app/views/comments/_comment.html.erb

  <b>мнения</b>
  <%= User.find(comment.user_id).email %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]