app/views/posts/index.html.erb

SELECT "categories".* FROM "categories"
---
<h2>All Categories</h2>
<% Category.all.each do |cat| %>