app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "лол"], ["post_id", 1], ["created_at", "2021-05-18 18:11:35.413919"], ["updated_at", "2021-05-18 18:11:35.413919"], ["user_id", 3]]
---
	def create
		@post = Post.find(params[:post_id])
		@comment = @post.comments.create(params[:comment].permit(:body).merge(user_id: current_user.id))