app/controllers/likes_controller.rb

  def create
     if already_liked?
       flash[:notice] = "Вы уже лайкнули!"
     else
       @post.likes.create(user_id: current_user.id)
---
INSERT INTO "likes" ("post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 1], ["user_id", 3], ["created_at", "2020-12-24 21:18:42.651151"], ["updated_at", "2020-12-24 21:18:42.651151"]]

  def already_liked?
    Like.where(user_id: current_user.id, post_id:
    params[:post_id]).exists?
---
SELECT 1 AS one FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 3], ["post_id", 1], ["LIMIT", 1]]