app/controllers/posts_controller.rb

  def index
      if params.has_key?(:category)
        @category = Category.find_by_name(params[:category])
        @posts = Post.where(category: @category)
      else
        @posts = Post.all
---
SELECT "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "места"], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = ?  [["category_id", 2]]
SELECT "posts".* FROM "posts"

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("name", "title", "content", "created_at", "updated_at", "author", "image", "user_id", "category_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "image" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["image", "0ffetLsGQyA.jpg"], ["updated_at", "2021-05-12 16:41:17.720014"], ["id", 1]]